The  SphericalLightDistribution  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  LightDistribution  .)
 See Also
  SphericalLightDistribution Class
  Autodesk.Revit.DB.Lighting Namespace